{
  "basics": {
    "name": "Jeff Skelton",
    "label": "Software Developer",
    "picture": "https://media.licdn.com/mpr/mpr/shrinknp_400_400/p/1/000/266/2e7/140dec9.jpg",
    "email": "jeff@jeffskelton.net",
    "phone": "(323) 316-8116",
    "website": "http://jeffskelton.net",
    "summary": "Jeff is a creative and professional developer with over 9 years in the field. Skilled in all phases of the software development lifecycle, he writes clean, readable, testable code and adheres to DRY principles. Jeff has experience with many languages, including PHP and C#, but is most passionate about JavaScript and NodeJS. He uses his excellent written and oral communication skills to mentor others in his spare time.",
    "location": {
      "address": "635 N Rosemary Ln",
      "postalCode": "CA 91505",
      "city": "Burbank",
      "countryCode": "US",
      "region": "California"
    },
    "profiles": [
      {
        "network": "Twitter",
        "username": "vikingpanicatk",
        "url": "http://twitter.com/vikingpanicatk"
      },
      {
        "network": "github",
        "username": "jeffskelton3",
        "url": "https://github.com/jeffskelton3"
      },
      {
        "network": "linkedin",
        "username": "jeffskelton",
        "url": "https://www.linkedin.com/in/jeffskelton"
      }
    ]
  },
  "work": [
    {
      "company": "AYO Inc",
      "position": "Software Developer",
      "website": "https://ayo.co",
      "startDate": "2015-07-01",
      "endDate": "2016-04-01",
      "summary": "AYO is a communication platform that enables fans to request personalized videos from their favorite celebrities.",
      "highlights": [
        "Part of a collaborative Agile development team supporting mission-critical web applications and business solutions.",
        "Identify and create solutions to technical challenges from product requirements.",
        "Identify and create solutions to technical challenges from product requirements.",
        "Designed and built a RESTful API backend using NodeJS, SailsJS, and MongoDB allowing for connections to e-commerce storefronts, admin panels, and 3rd party integrations.",
        "Created a video transcoding application using Amazon SQS, NodeJS, and ffmpeg to normalize format and adding branding to uploaded videos.",
        "Architected a build server and deployment solution using TeamCity and Amazon Elastic Beanstalk, enabling the team to safely deploy and/or rollback staging or production builds in minutes.",
        "Created a suite of integration and unit tests for all business critical applications.",
        "Build rapid prototypes for new business ideas.",
        "Research and integrate design strategies, product specifications, development schedules, and user expectations into product capabilities."
      ]
    },
    {
      "company": "Soundminer",
      "position": "Software Developer",
      "website": "http://soundminer.com/",
      "startDate": "2013-02-01",
      "endDate": "2015-07-01",
      "summary": "Soundminer is a music search engine targeting publishers, music libraries, and songwriters. Soundminer clients include Warner Chappell, Sony Music, and Disney.",
      "highlights": [
        "Part of a globally distributed team responsible for improving and maintaining a web based version of the native application.",
        "Client installations, upgrades, and support.",
        "Design and build a mobile friendly, JavaScript based SPA client using AngularJS.",
        "Responsible for managing and maintaining client installations and business applications hosted at Soundminer’s own datacenter.",
        "Git management",
        "Implement customized themes to match client branding and/or custom design requests.",
        "Designed automation scripts and documentation which allowed for a drastic reduction in installation/upgrade times and support requests.",
        "Migrated all source code off of Subversion and onto git with zero loss of commit history and metadata."
      ]
    },
    {
      "company": "Vyclone Inc",
      "position": "Software Developer",
      "website": "http://vyclone.com/",
      "startDate": "2014-01-01",
      "endDate": "2015-11-01",
      "summary": "Vyclone is a groundbreaking video collaboration app available on iOS, Android, and Windows Phone. It allows users to automatically create multi-angle movies with videos shot from multiple sources.",
      "highlights": [
        "Responsible for maintaining all web based products including the main site, Vyclone.com as well as implementing new features as they are requested.",
        "Part of a team rebuilding a suite of tools that allow brands and consumers alike to more easily leverage the core product and bring people together to use it."
      ]
    },
    {
      "company" : "SureSale",
      "website" : "https://www.suresale.com/",
      "startDate": "2012-01-01",
      "endDate": "2013-03-01",
      "summary" : "SureSale",
      "highlights": [
        "Developed a web-based inventory management application for used automotive dealerships. Dealers who sign up for an account are able to use this application to certify eligible vehicles in their inventory and generate extended warranties at time of sale.",
        "Created a web-based, responsive mobile inspection application for our network of inspectors.",
        "Part of a team that created an API for our mobile inspection applications.",
        "Part of a team that built out a system of “lite” accounts that would automatically import a dealer’s inventory from an outside feed and prompt the dealer to sign up to certify those vehicles."
      ]
    }
  ],
  "volunteer": [],
  "education": [],
  "awards": [],
  "publications": [],
  "skills": [
    {
      "name" : "Languages",
      "level" : "Master",
      "keywords" : [
        "JavaScript",
        "PHP",
        "C#"
      ]
    },
    {
      "name" : "JavaScript",
      "level" : "Master",
      "keywords" : [
        "AngularJS",
        "jQuery",
        "ES2015",
        "MooTools",
        "TypeScript"
      ]
    },
    {
      "name": "NodeJS",
      "level": "Master",
      "keywords": [
        "Express",
        "AdonisJS",
        "NodeJS",
        "NPM",
        "Babel"
      ]
    }
  ],
  "languages": [],
  "interests": [],
  "references": []
}